{"loss": "mse", "optimizer": {"nesterov": false, "lr": 0.009999999776482582, "name": "SGD", "momentum": 0.0, "decay": 0.0}, "class_name": "Sequential", "keras_version": "1.0.4", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 100, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 100, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}], "sample_weight_mode": null}